\h3{写在前面的话}

\h4{我是个业余的}

嗯，我确实是个业余的，不懂设计，不会设计，学理科，临床医学专业；但是由于没找到更合适的人，UX的设计暂时就由我来做了。然而，我一直在思考，像一个优秀的专业的那样思考，去发掘UX的内涵，去学着装“专业的”。

那，怎么样才算是专业的呢？我觉得，只有具备一定的素质的人，才能自称是专业的，而不论他在不在专业的岗位上。曾经，我执导了一部DV短剧，被学校送去参加评比了；某个电视台的某编导教诲我们：在字幕后安排搞笑的额外剧情是非常不专业的。“字幕是一件非常严肃的事情，是表示对所有参与人员的尊重的地方”，我不得不认同他的这样的评论，但我同时又认为，字幕后安排的剧情是“彩蛋”，是对认真看完字幕的观众的奖励，与字幕的严肃性没有任何冲突。而专业编导说道：“观众看到了字幕，就意味这结束了，就可以鼓掌离场了”。

不知道大家是否认同他的观点呢？

\h5{大众习惯}

习惯是可怕的，是扼杀创造力的最大的杀手。“别拿用户习惯说事！其实用户根本不知道他们自己需要什么，他们只是更喜欢自己的习惯”。做UX设计，应该尊重用户的习惯，但同时又不能纵容用户的习惯，为了迁就一些用户习惯，而破坏了整个产品的体验，这决定了你的产品是怎样的一个高度。就像恋爱一样（本人没有恋爱经历，纯属胡扯），你一味地去迁就对方的习惯，短期内对方会非常喜欢你；但是在这个过程中你丢失了自我，只会让对方渐渐看轻你；最后，你的好它习以为常，因为那个本来就是它的习惯，你的不好，它却无法忍受。而更好的恋爱关系应该是：互相可以看到对方的习惯，然后愿意尝试去改变，让双方的习惯变得更加完美，同时也更加接近。

回到做产品，作为设计者，我有自己的作为用户的习惯；同时，每个用户也有他自己的习惯，各个人的习惯不同。而产品应该是一个大众情人，他需要有自己的习惯，这个习惯不是我的，也不是其他任何人的，更加不是所有人的，而是独立于所有人的，属于产品自己的习惯。这个习惯的形成，来自我做为设计者的设计，也同时是与无数用户间互相磨合的妥协。

\h5{合格的设计者}

\bq{begin}
Behide every good design is a mind full of stories to tell.

\bq{end}

要成为设计者，必要的素质之一就是足够敏感，可以别人习以为常的东西里发现新的东西，有一双发现的眼睛。设计师的生活应该充满了探索与发现，他们不会无聊，不会失去激情，他们可以承受大量的信息输入，从中寻找共性，同时也能从小细节出发，发掘大量的信息。

设计者必须足够的人性（human），有一定的共情（empathy）能力，可以深入理解人的需要，用最恰当的方式去满足这些需要。设计需要理解产品，而理解你的产品，首先是理解你的目标用户。

理性对于设计者来说也非常重要。设计者并不等同与艺术家，前者关注人，后者关注艺术品本身。这就意味着，设计者可以有天马行空的想象，但这些必须由理性的支持，因为设计是被“使用”的，失去了理性的支持，设计就不能保证依然可以被“使用”。

我们常常称赞好的设计是一件艺术品，细细分析下，好的设计首先是设计，其次才是艺术品。艺术感对于设计不是必须的，但好的设计，艺术的成分必不可少。

设计应该关注可用性，可感知性与美感，三者间是递进的关系，好的设计，在保正了可用性的前提下，提高了可感知性，甚至提高的艺术性。

为了从众多的设计中选择最好的，设计者必须具备做决定的技能，掌握一些基本的原则，遵循一些有用的方法。
